Rails/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "juice"], ["price", 12.0], ["description", "orange juice"], ["admin_id", 3], ["created_at", "2022-06-28 18:03:01.362198"], ["updated_at", "2022-06-28 18:03:01.362198"]]
---
  def create
    # params[:article][:title]
    # params[:article][:body]
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "juice"], ["description", "orange juice"], ["updated_at", "2022-06-28 17:53:34.180509"], ["id", 2]]
---
  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)