Rails/app/views/products/_form.html.erb

SELECT "admins".* FROM "admins"
---
    <div>
      <%= collection_select(:product, :admin_id, Admin.all, :id, :name_with_initial, prompt: true) %>