Rails/app/views/products/show.html.erb

<% @x=@product.admin_id %>
<%= link_to Admin.find(@x).name, admin_path  %>
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]